Информационная_база/src/InformationRegisters/ЦеныНоменклатурыКонтрагентов/ЦеныНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Enums/СпособыРасчетаЦеныНабора/СпособыРасчетаЦеныНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаЦеныНабора</name>
  <enumValues>
    <name>СкладыватьИзЦенКомплектующих</name>
  </enumValues>
  <enumValues>
    <name>НазначаетсяИРаспределяетсяПоЦене</name>
  </enumValues>
  <enumValues>
    <name>НазначаетсяИРаспределяетсяПоДолеСтоимости</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/InformationRegisters/ЦеныНоменклатурыКонтрагентов/Forms/ФормаДляНоменклатуры/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура обработчик события ПриСозданииНаСервере.
// Осуществляет первоначальное заполнение реквизитов формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Отбор.Номенклатура;
		
		Если (Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас)
			И (Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.ПодарочныйСертификат) Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Цены контрагентов можно вводить только для номенклатуры с типами Запас, Сертификат'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Наборы
	Если НЕ Элементы.Список.ТолькоПросмотр И ТипЗнч(ВладелецФормы)=Тип("УправляемаяФорма") И ВладелецФормы.ИмяФормы="Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		ОбъектНоменклатура = ВладелецФормы.Объект;
		
		Если ОбъектНоменклатура.ЭтоНабор И ОбъектНоменклатура.СпособРасчетаЦеныНабора=ПредопределенноеЗначение("Перечисление.СпособыРасчетаЦеныНабора.СкладыватьИзЦенКомплектующих") Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Цены контрагентов недоступны для наборов со способом расчета цен по комплектующим'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли; 	
	// Конец Наборы
	
КонецПроцедуры
